const typeMap = {
  0: true,
  1: '诗经',
  2: '楚辞',
}

// 木生火 火生土 土生金 金生水 水生木 木克土 火克金 土克水 金克木 水克火
const wxRelation = {
  // s：生，k：克，bs：被生，bk：被克
  jin: {
    s: 'shui',
    k: 'mu',
    bs: 'tu',
    bk: 'huo'
  },
  mu: {
    s: 'huo',
    k: 'tu',
    bs: 'shui',
    bk: 'jin'
  },
  shui: {
    s: 'mu',
    k: 'huo',
    bs: 'jin',
    bk: 'tu'
  },
  huo: {
    s: 'tu',
    k: 'jin',
    bs: 'mu',
    bk: 'shui'
  },
  tu: {
    s: 'jin',
    k: 'shui',
    bs: 'huo',
    bk: 'mu'
  },
}

/**
 * 版权归作者所有，任何形式转载请联系作者。
 * 作者：易学君（来自豆瓣）
 * 来源：https://www.douban.com/note/714255106/

 * 1，日干甲木、乙木的人，出生于春天（西历11.8-5.5日）便算身旺，因木旺在春天，其他者当身衰计。春天万物萌芽，春暖花开小树粗壮，出生在这个春季的五行属木人自然能茁壮成长，潜力无限。

 * 2，日干丙火、丁火的人，出生于夏天（西历5.5-8.8日），当然身旺，算身旺计。其他者当身衰计。出生在四大火炉城市的人，夏天简直就是给五行属火的人火上浇油，想不“火”都难。

 * 3，日干戊土、已土的人，出生于农历三、六、九、十二月。另再加西历6.6-7.8日為身旺计。其他者当身衰计。四季交替之时，万物更替，春根、夏枝、秋叶、冬霜皆被泥泞食作果腹。出生在这几个交替的边界之间的五行属土人自然是心系大地，宽广而厚重。

 * 4，日干庚金、辛金的人，出生于秋天（西历8.8-11.7日），為身旺计。其他者当身衰计。秋高气爽人精神，喜上眉梢，绿叶换金装，摇曳之间，漫天金黄，出生在如此美景之中的五行属金人自然是“金枝玉叶”。

 * 5，日干壬水、癸水的人，出生于冬天（西历11.8-2.4日及8.8-10.8日）為身旺计。其他者当身衰计。万物凋零之时，唯独溪、海流着欢快，出门冷得一塌糊涂，摸摸海水却是暖洋洋。出生在如此冬季的五行属水人自然是湍流不息，海纳百川有容乃大。
 * 春 3，4，5
 */
const season = {
  '甲-3': true,
  '甲-4': true,
  '甲-5': true,
  '乙-3': true,
  '乙-4': true,
  '乙-5': true,

  '丙-6': true,
  '丙-7': true,
  '丙-8': true,
  '丁-6': true,
  '丁-7': true,
  '丁-8': true,

  '戊-3': true,
  '戊-6': true,
  '戊-7': true,
  '戊-12': true,
  '己-3': true,
  '己-6': true,
  '己-7': true,
  '己-12': true,

  '庚-9': true,
  '庚-10': true,
  '庚-11': true,
  '辛-9': true,
  '辛-10': true,
  '辛-11': true,

  '壬-12': true,
  '壬-1': true,
  '壬-2': true,
  '癸-12': true,
  '癸-1': true,
  '癸-2': true,
}

/**
 * 根据五行身强、身弱来判断喜用神
 * key1-key2
 * key1，0：身过弱，1：身弱，2：身强，3：身过强
 * key2，0：身过衰，1：身衰，2：身旺，3：身过旺
 */
const wxLikeUseMap = {
  '金': {                 
    '2-2': [ '水' ],     
    '2-1': [ '水', '土' ],
    '1-1': [ '金', '土' ],
    '1-2': [ '金', '水' ],
    '3-2': [ '火', '水' ],
    '3-1': [ '火', '土' ],
    '0-2': [ '金', '水' ],
    '0-1': [ '金', '土' ],
    '2-3': [ '木', '水' ],
    '3-3': [ '木', '水' ],
    '1-3': [ '木', '金' ],
    '0-3': [ '木', '金' ],
    '2-0': [ '土', '水' ],
    '3-0': [ '土', '水' ],
    '1-0': [ '土', '金' ],
    '0-0': [ '土', '金' ] 
  },
  '木': {                   
    '2-2': [ '火' ],     
    '2-1': [ '火' ],     
    '1-1': [ '木', '水' ],
    '1-2': [ '木' ],     
    '3-2': [ '金', '火' ],
    '3-1': [ '金' ],     
    '0-2': [ '木', '火' ],
    '0-1': [ '木' ],     
    '2-3': [ '土', '火' ],
    '3-3': [ '土', '火' ],
    '1-3': [ '土', '木' ],
    '0-3': [ '土', '木' ],
    '2-0': [ '水', '火' ],
    '3-0': [ '水', '火' ],
    '1-0': [ '水', '木' ],
    '0-0': [ '水', '木' ] 
  },
  '水': {
    '2-2': [ '木' ],     
    '2-1': [ '木', '金' ],
    '1-1': [ '水', '金' ],
    '1-2': [ '水', '木' ],
    '3-2': [ '土', '木' ],
    '3-1': [ '土', '金' ],
    '0-2': [ '水', '木' ],
    '0-1': [ '水', '金' ],
    '2-3': [ '火', '木' ],
    '3-3': [ '火', '木' ],
    '1-3': [ '火', '水' ],
    '0-3': [ '火', '水' ],
    '2-0': [ '金', '木' ],
    '3-0': [ '金', '木' ],
    '1-0': [ '金', '水' ],
    '0-0': [ '金', '水' ] 
  },
  '火': {
    '2-2': [ '土' ],
    '2-1': [ '土', '木' ],
    '1-1': [ '火', '木' ],
    '1-2': [ '火', '土' ],
    '3-2': [ '水', '土' ],
    '3-1': [ '水', '木' ],
    '0-2': [ '火', '土' ],
    '0-1': [ '火', '木' ],
    '2-3': [ '金', '土' ],
    '3-3': [ '金', '土' ],
    '1-3': [ '金', '火' ],
    '0-3': [ '金', '火' ],
    '2-0': [ '木', '土' ],
    '3-0': [ '木', '土' ],
    '1-0': [ '木', '火' ],
    '0-0': [ '木', '火' ]
  },
  '土': {
    '2-2': [ '金' ],
    '2-1': [ '金', '火' ],
    '1-1': [ '土', '火' ],
    '1-2': [ '土', '金' ],
    '3-2': [ '木', '金' ],
    '3-1': [ '木', '火' ],
    '0-2': [ '土', '金' ],
    '0-1': [ '土', '火' ],
    '2-3': [ '水', '金' ],
    '3-3': [ '水', '金' ],
    '1-3': [ '水', '土' ],
    '0-3': [ '水', '土' ],
    '2-0': [ '火', '金' ],
    '3-0': [ '火', '金' ],
    '1-0': [ '火', '土' ],
    '0-0': [ '火', '土' ]
  }
}

module.exports = {
  typeMap,
  wxRelation,
  season,
  wxLikeUseMap
}